{
  "locales": {
    "en": {
      "title": "Education",
      "title_long_prefix": "This is my",
      "title_long": "**Educational** Background"
    },

    "es": {
      "title": "Educación",
      "title_long_prefix": "Esta es mi",
      "title_long": "**Formación** Educativa"
    },

    "fr": {
      "title": "Éducation",
      "title_long_prefix": "C'est mon",
      "title_long": "**Contexte** Éducatif"
    },

    "ko": {
      "title": "교육",
      "title_long_prefix": "이것은 내",
      "title_long": "**교육적** 배경"
    }
  },

  "articles": [
    {
      "id": "academic",
      "component": "ArticleTimeline",
      "config": {},
      "locales": {},

      "items": [
        {
          "icon": {
            "img": "",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {},
          "locales": {
            "en": {
              "title": "Intermediate React Course",
              "info": "Platzi",
              "text": "Completed an intermediate React course, where I enhanced my skills in component-based development, advanced state management, hooks, and routing to build more dynamic web applications."
            },
            "es": {
              "title": "Curso de React Intermedio",
              "info": "Platzi",
              "text": "Completé un curso intermedio de React, donde mejoré mis habilidades en desarrollo basado en componentes, manejo avanzado de estado, hooks y enrutamiento para crear aplicaciones web más dinámicas."
            },
            "fr": {
              "title": "Cours React Intermédiaire",
              "info": "Platzi",
              "text": "J'ai terminé un cours intermédiaire de React, où j'ai amélioré mes compétences dans le développement basé sur des composants, la gestion d'état avancée, les hooks et le routage pour créer des applications web plus dynamiques."
            },
            "ko": {
              "title": "중급 React 과정",
              "info": "Platzi",
              "text": "컴포넌트 기반 개발, 고급 상태 관리, 훅 및 라우팅에 대한 기술을 향상시켜 더 동적인 웹 애플리케이션을 만드는 중급 React 과정을 완료했습니다."
            }
          }
        },

        {
          "icon": {
            "img": "",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {},
          "locales": {
            "en": {
              "title": "Technical Degree in Web Programming",
              "info": "Infotep",
              "text": "Completed a technical degree in Web Programming, which included front-end development, back-end programming, and web technologies, preparing me to build full-stack web applications."
            },
            "es": {
              "title": "Técnico en Programación Web",
              "info": "Infotep",
              "text": "Completé un técnico en programación web, que incluyó desarrollo front-end, programación back-end y tecnologías web, preparándome para crear aplicaciones web full-stack."
            },
            "fr": {
              "title": "Diplôme Technique en Programmation Web",
              "info": "Infotep",
              "text": "J'ai terminé un diplôme technique en programmation web, qui comprenait le développement front-end, la programmation back-end et les technologies web, me préparant à créer des applications web full-stack."
            },
            "ko": {
              "title": "웹 프로그래밍 기술학위",
              "info": "Infotep",
              "text": "웹 프로그래밍 기술학위를 취득하여 프론트엔드 개발, 백엔드 프로그래밍, 웹 기술 등을 배웠으며, 풀스택 웹 애플리케이션을 만들 수 있도록 준비되었습니다."
            }
          }
        },

        {
          "icon": {
            "img": "",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {},
          "locales": {
            "en": {
              "title": "Technical Degree in Databases",
              "info": "Infotep",
              "text": "Earned a technical degree in Databases, learning about database design, management, and optimization, including both SQL and NoSQL systems."
            },
            "es": {
              "title": "Técnico en Bases de Datos",
              "info": "Infotep",
              "text": "Obtuve un técnico en bases de datos, aprendiendo sobre diseño, gestión y optimización de bases de datos, incluyendo sistemas tanto SQL como NoSQL."
            },
            "fr": {
              "title": "Diplôme Technique en Bases de Données",
              "info": "Infotep",
              "text": "J'ai obtenu un diplôme technique en bases de données, apprenant la conception, la gestion et l'optimisation des bases de données, y compris les systèmes SQL et NoSQL."
            },
            "ko": {
              "title": "데이터베이스 기술학위",
              "info": "Infotep",
              "text": "데이터베이스 설계, 관리 및 최적화에 대해 배우며, SQL 및 NoSQL 시스템을 포함한 기술학위를 취득했습니다."
            }
          }
        },

        {
          "icon": {
            "img": "",
            "fa": "",
            "faColors": { "bg": null, "fill": null }
          },
          "dates": {},
          "locales": {
            "en": {
              "title": "Intermediate JavaScript Course",
              "info": "Platzi",
              "text": "Completed an intermediate JavaScript course, focusing on advanced concepts such as closures, promises, asynchronous programming, and design patterns."
            },
            "es": {
              "title": "Curso de JavaScript Intermedio",
              "info": "Platzi",
              "text": "Completé un curso intermedio de JavaScript, enfocándome en conceptos avanzados como closures, promesas, programación asíncrona y patrones de diseño."
            },
            "fr": {
              "title": "Cours de JavaScript Intermédiaire",
              "info": "Platzi",
              "text": "J'ai terminé un cours intermédiaire de JavaScript, en me concentrant sur des concepts avancés tels que les closures, les promesses, la programmation asynchrone et les modèles de conception."
            },
            "ko": {
              "title": "중급 JavaScript 과정",
              "info": "Platzi",
              "text": "고급 개념인 클로저, 프로미스, 비동기 프로그래밍 및 디자인 패턴에 중점을 둔 중급 JavaScript 과정을 완료했습니다."
            }
          }
        }
      ]
    }
  ]
}
